portals/developer-portal/samples/apis/leisure-soap-v1.0/definition.yml

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="LeisureActivitiesService"
  targetNamespace="http://example.com/leisure"
  xmlns="http://schemas.xmlsoap.org/wsdl/"
  xmlns:tns="http://example.com/leisure"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">

  <types>
    <xsd:schema targetNamespace="http://example.com/leisure">

      <xsd:element name="SearchActivitiesRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="location"  type="xsd:string"/>
            <xsd:element name="category"  type="xsd:string"  minOccurs="0"/>
            <xsd:element name="maxPrice"  type="xsd:decimal" minOccurs="0"/>
            <xsd:element name="date"      type="xsd:date"    minOccurs="0"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <xsd:element name="SearchActivitiesResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="activity" minOccurs="0" maxOccurs="unbounded">
              <xsd:complexType>
                <xsd:sequence>
                  <xsd:element name="id"           type="xsd:string"/>
                  <xsd:element name="name"         type="xsd:string"/>
                  <xsd:element name="category"     type="xsd:string"/>
                  <xsd:element name="price"        type="xsd:decimal"/>
                  <xsd:element name="availability" type="xsd:boolean"/>
                  <xsd:element name="location"     type="xsd:string"/>
                </xsd:sequence>
              </xsd:complexType>
            </xsd:element>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <xsd:element name="BookActivityRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="activityId"    type="xsd:string"/>
            <xsd:element name="userId"        type="xsd:string"/>
            <xsd:element name="date"          type="xsd:date"/>
            <xsd:element name="participants"  type="xsd:integer"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <xsd:element name="BookActivityResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="bookingId"         type="xsd:string"/>
            <xsd:element name="status"            type="xsd:string"/>
            <xsd:element name="confirmationCode"  type="xsd:string"/>
            <xsd:element name="totalPrice"        type="xsd:decimal"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <xsd:element name="CancelBookingRequest">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="bookingId" type="xsd:string"/>
            <xsd:element name="userId"    type="xsd:string"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

      <xsd:element name="CancelBookingResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="success" type="xsd:boolean"/>
            <xsd:element name="message" type="xsd:string"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>

    </xsd:schema>
  </types>

  <message name="SearchActivitiesInput">
    <part name="parameters" element="tns:SearchActivitiesRequest"/>
  </message>
  <message name="SearchActivitiesOutput">
    <part name="parameters" element="tns:SearchActivitiesResponse"/>
  </message>
  <message name="BookActivityInput">
    <part name="parameters" element="tns:BookActivityRequest"/>
  </message>
  <message name="BookActivityOutput">
    <part name="parameters" element="tns:BookActivityResponse"/>
  </message>
  <message name="CancelBookingInput">
    <part name="parameters" element="tns:CancelBookingRequest"/>
  </message>
  <message name="CancelBookingOutput">
    <part name="parameters" element="tns:CancelBookingResponse"/>
  </message>

  <portType name="LeisureActivitiesPortType">
    <operation name="searchActivities">
      <documentation>Search for available activities by location, category, and price.</documentation>
      <input  message="tns:SearchActivitiesInput"/>
      <output message="tns:SearchActivitiesOutput"/>
    </operation>
    <operation name="bookActivity">
      <documentation>Book an activity for a given user, date, and participant count.</documentation>
      <input  message="tns:BookActivityInput"/>
      <output message="tns:BookActivityOutput"/>
    </operation>
    <operation name="cancelBooking">
      <documentation>Cancel a previously confirmed booking.</documentation>
      <input  message="tns:CancelBookingInput"/>
      <output message="tns:CancelBookingOutput"/>
    </operation>
  </portType>

  <binding name="LeisureActivitiesBinding" type="tns:LeisureActivitiesPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="searchActivities">
      <soap:operation soapAction="http://example.com/leisure/searchActivities"/>
      <input><soap:body use="literal"/></input>
      <output><soap:body use="literal"/></output>
    </operation>
    <operation name="bookActivity">
      <soap:operation soapAction="http://example.com/leisure/bookActivity"/>
      <input><soap:body use="literal"/></input>
      <output><soap:body use="literal"/></output>
    </operation>
    <operation name="cancelBooking">
      <soap:operation soapAction="http://example.com/leisure/cancelBooking"/>
      <input><soap:body use="literal"/></input>
      <output><soap:body use="literal"/></output>
    </operation>
  </binding>

  <service name="LeisureActivitiesService">
    <port name="LeisureActivitiesPort" binding="tns:LeisureActivitiesBinding">
      <soap:address location="https://leisure.example.com/services/LeisureService"/>
    </port>
  </service>

</definitions>
